<script setup>
import Carousel from './components/carousel/Carousel.vue';
import Typography from '../../components/Typography.vue';
</script>
<template>
    <div w='xl:1032px' p-x-lt-md margin-center>
        <typography color='primary'>
            <template #default>
                <h3>热门推荐</h3>
            </template>
        </typography>
        <carousel />
        <typography color='primary'>
            <h3>看看我的</h3>
        </typography>
        <div bg-container p='6'>
            <p data-aos='animate__fadeInUp'>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p data-aos='animate__fadeInUp'>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p data-aos='animate__fadeInUp'>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p data-aos='animate__fadeInUp'>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p><p data-aos='animate__fadeInUp'>
            阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p data-aos='animate__fadeInUp'>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p><p data-aos='animate__fadeInUp'>
            阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p><p data-aos='animate__fadeInUp'>
            阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p>




        </div>
        <typography color='primary'>
            <h3>看看你的</h3>
        </typography>
        <div data-aos='animate__fadeInUp' bg-container p='10'>
            <span>123</span>
            <p>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p>
                阿斯顿糊咖交换机咖阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是何况是</p>
            <p>
                阿斯顿糊咖交换机咖阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是时间苦上加苦感觉看哈速度加快公司更何况是</p>
            <p>
                阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是阿斯顿糊咖交换机咖时间苦上加苦感觉看哈速度加快公司更何况是况是地点</p>
        </div>
    </div>
</template>